# ArrowLineWeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayVectorSettings..::..ArrowLineWeight Property
AnalysisDisplayVectorSettings Class See Also
---
Line weight assigned to arrow lines for vectors.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int ArrowLineWeight { get; set; }
```

Visual Basic
---
```text
Public Property ArrowLineWeight As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int ArrowLineWeight {
	int get ();
	void set (int value);
}
```

# See Also
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace